Revit 2024 API
ScheduleField.CreatesCircularReferences Method
 Checks whether a field ID would create a circular chain of references when used by the PercentageOf property of this field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool CreatesCircularReferences(
	ScheduleFieldId fieldId
)
Visual Basic
Public Function CreatesCircularReferences ( _
	fieldId As ScheduleFieldId _
) As Boolean
Visual C++
public:
bool CreatesCircularReferences(
	ScheduleFieldId^ fieldId
)
Parameters
fieldId
Type: Autodesk.Revit.DB.ScheduleFieldId
 The field ID to check.
Return Value
 True if the field ID would create a circular chain of references, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  fieldId is not InvalidScheduleFieldId or the ID of a field that can be used to calculated percentages.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace